// 跳过宏定义
#define <stdio.h>
#define _MAX_ 10

// 支持二进制、八进制、十进制、十六进制、浮点数
0x01    // 十六进制
0b10    // 二进制
123     // 十进制
0.121   // 浮点数
15.241  // 浮点数


// 不合法的数字
099      // 非法八进制
0x19QW   // 非法的十六进制
0b13m    // 非法的二进制
123JSA   // 非法的数字
0f123as	 // 非法的进制表示
0.123a   // 非法的浮点数
123.14.981  // 非法的浮点数
123.        // 没有小数部分的浮点数

// 字符串
print("hello world");
print("line1//not comments");		// 可以区分字符串内的注释符号
print("hello1\"hello2");			// 可以区分引号的转义
print("line1\nlin2");

// 字符
char a = '\n'			// 支持转义
char b = 'b'
char c = 'abc'			// 可以识别多字符
char d = '\t'




// 运算符
a++;
b = c + 5;
a+++++
a<<
m.d


// 怪字符
a $ 6;

5;


